init.org
#+PROPERTY: header-args :tangle init.el

* Disable UI Stuff
#+begin_src emacs_lisp
(scroll-bar-mode -1)
(tool-bar-mode -1)
(menu-bar-mode -1)
(setq inhibit-startup-screen  t
      initial-scratch-message nil)
#+end_src

* Cursor Customization
#+begin_src emacs_lisp
(global-hl-line-mode)
(blink-cursor-mode -1)
#+end_src

* Frame Format
#+begin_src emacs_lisp
(setq frame-title-format "electronic macaronis")
(add-hook 'emacs-startup-hook 'toggle-frame-maximized)
#+end_src

* No Weird File Shenanigans
** BackFiles & Friends
#+begin_src emacs_lisp
(auto-save-mode -1)
(setq make-backup-files nil
      create-lockfiles  nil)
#+end_src

** Move Emacs' Auto-configurations to another file
#+begin_src emacs_lisp
(setq custom-file "~/.emacs.d/.emacs.custom.el")
(load custom-file)
#+end_src

* No funny bell noise(most of the time)
#+begin_src emacs_lisp
(setq ring-bell-function 'ignore)  
#+end_src

* Extra Whitespace BEGONE!
#+begin_src emacs_lisp
(global-set-key (kbd "C-c s") 'just-one-space)  
#+end_src

* Use UTF-8 Character Encoding
#+begin_src emacs_lisp
(set-language-environment "UTF-8")
(prefer-coding-system 'utf-8)
#+end_src

* Package setup
#+begin_src emacs_lisp
(require 'package)
(add-to-list 'package-archives
             '("melpa-stable" . "https://stable.melpa.org/packages/") t)
(unless (package-installed-p 'use-package)
  (package-install 'use-package))
(require 'use-package)
(setq use-package-always-ensure t)
#+end_src

* Aesthetics
#+begin_src emacs_lisp
(set-face-attribute 'default nil :font "BlexMono Nerd Font Mono" :height 110)
(use-package nord-theme
  :config
  (load-theme 'nord t))
#+end_src
  
* TABS are now SPACES buahahahahhaha
#+begin_src emacs_lisp
(setq-default indent-tabs-mode nil
              tab-width        4)
#+end_src

* c-mode
#+begin_src emacs_lisp
(global-set-key (kbd "C-c c") 'compile)
(global-set-key (kbd "C-c r") 'recompile)
#+end_src

* nasm-mode
#+begin_src emacs_lisp
(use-package nasm-mode
  :mode "\\.asm\\'")
#+end_src

* org-mode
#+begin_src emacs_lisp
(use-package org
  :config
  (add-hook 'org-mode-hook 'org-indent-mode)
  (custom-set-faces
   '(org-level-1 ((t (:inherit outline-1 :height 1.2))))
   '(org-level-2 ((t (:inherit outline-2 :height 1.1))))))
#+end_src

* Git Integration
#+begin_src emacs_lisp
(use-package magit
  :defer t)
#+end_src

* Completion Framework
#+begin_src emacs_lisp
(use-package vertico
  :init
  (vertico-mode 1)
  :config
  (setq vertico-count 5))
#+end_src

* TODO Maybe Add Projectile or something
